mermaid instead of ascii
